benchmark/experience-2/1000ms-tmaret-002-kernel-1000-500.txt
Running 25s test @ http://localhost:8080/sync?cpuIterations=13300&idleDelay=960&fileLength=100000
  500 threads and 500 connections
  Thread calibration: mean lat.: 4574.720ms, rate sampling interval: 15572ms
  Thread calibration: mean lat.: 4959.846ms, rate sampling interval: 15745ms
  Thread calibration: mean lat.: 4459.136ms, rate sampling interval: 15859ms
  Thread calibration: mean lat.: 4647.936ms, rate sampling interval: 16121ms
  Thread calibration: mean lat.: 4572.032ms, rate sampling interval: 16383ms
  Thread calibration: mean lat.: 5350.604ms, rate sampling interval: 17186ms
  Thread calibration: mean lat.: 5219.123ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 5821.184ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 5235.968ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 5061.734ms, rate sampling interval: 16105ms
  Thread calibration: mean lat.: 5461.196ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 5125.017ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 4464.000ms, rate sampling interval: 15466ms
  Thread calibration: mean lat.: 5224.038ms, rate sampling interval: 16072ms
  Thread calibration: mean lat.: 4628.992ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 4566.528ms, rate sampling interval: 15294ms
  Thread calibration: mean lat.: 4790.272ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 4484.608ms, rate sampling interval: 15417ms
  Thread calibration: mean lat.: 5354.700ms, rate sampling interval: 16605ms
  Thread calibration: mean lat.: 4595.712ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 4501.094ms, rate sampling interval: 14868ms
  Thread calibration: mean lat.: 4605.440ms, rate sampling interval: 15769ms
  Thread calibration: mean lat.: 5204.224ms, rate sampling interval: 15917ms
  Thread calibration: mean lat.: 4515.456ms, rate sampling interval: 15908ms
  Thread calibration: mean lat.: 5382.144ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 5249.024ms, rate sampling interval: 16039ms
  Thread calibration: mean lat.: 4886.528ms, rate sampling interval: 15933ms
  Thread calibration: mean lat.: 4740.096ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 4916.224ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 4738.560ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 4624.384ms, rate sampling interval: 15654ms
  Thread calibration: mean lat.: 4523.008ms, rate sampling interval: 15400ms
  Thread calibration: mean lat.: 4604.416ms, rate sampling interval: 16007ms
  Thread calibration: mean lat.: 5358.387ms, rate sampling interval: 17350ms
  Thread calibration: mean lat.: 5416.192ms, rate sampling interval: 16097ms
  Thread calibration: mean lat.: 5015.142ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5155.584ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 4832.256ms, rate sampling interval: 15843ms
  Thread calibration: mean lat.: 5455.052ms, rate sampling interval: 16777ms
  Thread calibration: mean lat.: 5518.592ms, rate sampling interval: 15941ms
  Thread calibration: mean lat.: 4832.768ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 5185.945ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 4907.008ms, rate sampling interval: 15917ms
  Thread calibration: mean lat.: 5224.192ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 4849.664ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 4740.096ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 4788.224ms, rate sampling interval: 15761ms
  Thread calibration: mean lat.: 4562.432ms, rate sampling interval: 15319ms
  Thread calibration: mean lat.: 4820.480ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 5089.792ms, rate sampling interval: 16171ms
  Thread calibration: mean lat.: 5954.304ms, rate sampling interval: 16605ms
  Thread calibration: mean lat.: 4898.816ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 4866.560ms, rate sampling interval: 15974ms
  Thread calibration: mean lat.: 5570.150ms, rate sampling interval: 16580ms
  Thread calibration: mean lat.: 5938.432ms, rate sampling interval: 16474ms
  Thread calibration: mean lat.: 4762.624ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 6106.368ms, rate sampling interval: 16605ms
  Thread calibration: mean lat.: 4782.080ms, rate sampling interval: 15425ms
  Thread calibration: mean lat.: 5565.184ms, rate sampling interval: 16130ms
  Thread calibration: mean lat.: 4640.768ms, rate sampling interval: 15155ms
  Thread calibration: mean lat.: 6235.392ms, rate sampling interval: 17563ms
  Thread calibration: mean lat.: 5086.720ms, rate sampling interval: 15982ms
  Thread calibration: mean lat.: 5495.125ms, rate sampling interval: 16089ms
  Thread calibration: mean lat.: 5045.760ms, rate sampling interval: 15982ms
  Thread calibration: mean lat.: 5933.824ms, rate sampling interval: 16318ms
  Thread calibration: mean lat.: 4712.448ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 4975.616ms, rate sampling interval: 15155ms
  Thread calibration: mean lat.: 5533.440ms, rate sampling interval: 16023ms
  Thread calibration: mean lat.: 5745.664ms, rate sampling interval: 16777ms
  Thread calibration: mean lat.: 4721.664ms, rate sampling interval: 15499ms
  Thread calibration: mean lat.: 5116.006ms, rate sampling interval: 16326ms
  Thread calibration: mean lat.: 5720.320ms, rate sampling interval: 16080ms
  Thread calibration: mean lat.: 5445.290ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 4756.480ms, rate sampling interval: 15400ms
  Thread calibration: mean lat.: 4877.824ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 4644.352ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 6203.136ms, rate sampling interval: 17367ms
  Thread calibration: mean lat.: 5398.272ms, rate sampling interval: 15646ms
  Thread calibration: mean lat.: 5191.424ms, rate sampling interval: 15646ms
  Thread calibration: mean lat.: 6372.608ms, rate sampling interval: 18300ms
  Thread calibration: mean lat.: 6194.432ms, rate sampling interval: 17055ms
  Thread calibration: mean lat.: 5540.181ms, rate sampling interval: 16039ms
  Thread calibration: mean lat.: 4760.576ms, rate sampling interval: 15466ms
  Thread calibration: mean lat.: 5236.480ms, rate sampling interval: 15769ms
  Thread calibration: mean lat.: 6015.232ms, rate sampling interval: 16596ms
  Thread calibration: mean lat.: 5327.104ms, rate sampling interval: 15908ms
  Thread calibration: mean lat.: 5045.760ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 5859.584ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 5091.072ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 5417.216ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 5165.312ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 5242.624ms, rate sampling interval: 15761ms
  Thread calibration: mean lat.: 5788.928ms, rate sampling interval: 16179ms
  Thread calibration: mean lat.: 5334.220ms, rate sampling interval: 16564ms
  Thread calibration: mean lat.: 4859.904ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 4756.480ms, rate sampling interval: 15392ms
  Thread calibration: mean lat.: 5482.837ms, rate sampling interval: 15892ms
  Thread calibration: mean lat.: 5828.352ms, rate sampling interval: 16318ms
  Thread calibration: mean lat.: 5495.040ms, rate sampling interval: 15867ms
  Thread calibration: mean lat.: 5940.992ms, rate sampling interval: 16302ms
  Thread calibration: mean lat.: 5949.696ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 4762.112ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 5401.344ms, rate sampling interval: 15548ms
  Thread calibration: mean lat.: 5052.928ms, rate sampling interval: 15810ms
  Thread calibration: mean lat.: 4986.880ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 5307.187ms, rate sampling interval: 16769ms
  Thread calibration: mean lat.: 6092.032ms, rate sampling interval: 16760ms
  Thread calibration: mean lat.: 5439.829ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5235.456ms, rate sampling interval: 15859ms
  Thread calibration: mean lat.: 5227.776ms, rate sampling interval: 15581ms
  Thread calibration: mean lat.: 4771.328ms, rate sampling interval: 15474ms
  Thread calibration: mean lat.: 4999.680ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 5259.520ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 4794.368ms, rate sampling interval: 15155ms
  Thread calibration: mean lat.: 5624.064ms, rate sampling interval: 16121ms
  Thread calibration: mean lat.: 5495.125ms, rate sampling interval: 15736ms
  Thread calibration: mean lat.: 5467.818ms, rate sampling interval: 15605ms
  Thread calibration: mean lat.: 6305.536ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 6192.896ms, rate sampling interval: 17285ms
  Thread calibration: mean lat.: 5409.109ms, rate sampling interval: 15769ms
  Thread calibration: mean lat.: 5401.856ms, rate sampling interval: 15859ms
  Thread calibration: mean lat.: 5401.600ms, rate sampling interval: 15769ms
  Thread calibration: mean lat.: 5802.752ms, rate sampling interval: 16277ms
  Thread calibration: mean lat.: 5832.960ms, rate sampling interval: 16269ms
  Thread calibration: mean lat.: 5138.688ms, rate sampling interval: 15695ms
  Thread calibration: mean lat.: 5233.408ms, rate sampling interval: 15843ms
  Thread calibration: mean lat.: 5932.800ms, rate sampling interval: 16457ms
  Thread calibration: mean lat.: 5901.568ms, rate sampling interval: 16351ms
  Thread calibration: mean lat.: 5826.304ms, rate sampling interval: 16236ms
  Thread calibration: mean lat.: 5015.040ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5147.392ms, rate sampling interval: 15179ms
  Thread calibration: mean lat.: 6098.176ms, rate sampling interval: 16924ms
  Thread calibration: mean lat.: 4583.424ms, rate sampling interval: 15581ms
  Thread calibration: mean lat.: 4411.776ms, rate sampling interval: 15441ms
  Thread calibration: mean lat.: 5816.576ms, rate sampling interval: 16302ms
  Thread calibration: mean lat.: 4697.600ms, rate sampling interval: 15228ms
  Thread calibration: mean lat.: 5586.602ms, rate sampling interval: 16211ms
  Thread calibration: mean lat.: 5279.744ms, rate sampling interval: 15958ms
  Thread calibration: mean lat.: 5195.520ms, rate sampling interval: 15310ms
  Thread calibration: mean lat.: 5314.304ms, rate sampling interval: 15589ms
  Thread calibration: mean lat.: 5100.032ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 4724.736ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 5284.608ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 5423.872ms, rate sampling interval: 15269ms
  Thread calibration: mean lat.: 5887.232ms, rate sampling interval: 16392ms
  Thread calibration: mean lat.: 5723.392ms, rate sampling interval: 16244ms
  Thread calibration: mean lat.: 5346.986ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 4687.872ms, rate sampling interval: 15392ms
  Thread calibration: mean lat.: 5197.056ms, rate sampling interval: 15982ms
  Thread calibration: mean lat.: 5446.656ms, rate sampling interval: 16113ms
  Thread calibration: mean lat.: 5041.920ms, rate sampling interval: 15171ms
  Thread calibration: mean lat.: 5443.174ms, rate sampling interval: 17203ms
  Thread calibration: mean lat.: 4910.592ms, rate sampling interval: 15507ms
  Thread calibration: mean lat.: 5933.312ms, rate sampling interval: 16449ms
  Thread calibration: mean lat.: 4919.808ms, rate sampling interval: 16023ms
  Thread calibration: mean lat.: 5620.480ms, rate sampling interval: 15990ms
  Thread calibration: mean lat.: 4804.096ms, rate sampling interval: 15646ms
  Thread calibration: mean lat.: 5479.628ms, rate sampling interval: 17776ms
  Thread calibration: mean lat.: 5373.696ms, rate sampling interval: 15343ms
  Thread calibration: mean lat.: 5191.936ms, rate sampling interval: 15532ms
  Thread calibration: mean lat.: 5427.541ms, rate sampling interval: 15785ms
  Thread calibration: mean lat.: 5810.380ms, rate sampling interval: 16891ms
  Thread calibration: mean lat.: 5185.792ms, rate sampling interval: 15515ms
  Thread calibration: mean lat.: 4925.952ms, rate sampling interval: 15106ms
  Thread calibration: mean lat.: 5623.552ms, rate sampling interval: 16015ms
  Thread calibration: mean lat.: 5571.584ms, rate sampling interval: 16326ms
  Thread calibration: mean lat.: 4892.672ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 4763.136ms, rate sampling interval: 15155ms
  Thread calibration: mean lat.: 5532.416ms, rate sampling interval: 15777ms
  Thread calibration: mean lat.: 5399.296ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 5478.741ms, rate sampling interval: 15900ms
  Thread calibration: mean lat.: 6193.920ms, rate sampling interval: 17285ms
  Thread calibration: mean lat.: 6156.544ms, rate sampling interval: 16760ms
  Thread calibration: mean lat.: 5380.352ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 4738.048ms, rate sampling interval: 15695ms
  Thread calibration: mean lat.: 4937.728ms, rate sampling interval: 15286ms
  Thread calibration: mean lat.: 4777.472ms, rate sampling interval: 15597ms
  Thread calibration: mean lat.: 5747.456ms, rate sampling interval: 16154ms
  Thread calibration: mean lat.: 5536.085ms, rate sampling interval: 16195ms
  Thread calibration: mean lat.: 4802.560ms, rate sampling interval: 15597ms
  Thread calibration: mean lat.: 5547.008ms, rate sampling interval: 16211ms
  Thread calibration: mean lat.: 5568.170ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 4760.064ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 5879.552ms, rate sampling interval: 16343ms
  Thread calibration: mean lat.: 6334.720ms, rate sampling interval: 18481ms
  Thread calibration: mean lat.: 5104.896ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 5131.008ms, rate sampling interval: 15335ms
  Thread calibration: mean lat.: 4718.080ms, rate sampling interval: 15212ms
  Thread calibration: mean lat.: 5417.301ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 6034.688ms, rate sampling interval: 16613ms
  Thread calibration: mean lat.: 5045.043ms, rate sampling interval: 16031ms
  Thread calibration: mean lat.: 5963.520ms, rate sampling interval: 16269ms
  Thread calibration: mean lat.: 4797.952ms, rate sampling interval: 15466ms
  Thread calibration: mean lat.: 5429.657ms, rate sampling interval: 17694ms
  Thread calibration: mean lat.: 4516.864ms, rate sampling interval: 15458ms
  Thread calibration: mean lat.: 4784.640ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 5437.781ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 5182.208ms, rate sampling interval: 15122ms
  Thread calibration: mean lat.: 4652.544ms, rate sampling interval: 15564ms
  Thread calibration: mean lat.: 5245.184ms, rate sampling interval: 15269ms
  Thread calibration: mean lat.: 5210.368ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 5840.640ms, rate sampling interval: 16203ms
  Thread calibration: mean lat.: 5519.018ms, rate sampling interval: 16244ms
  Thread calibration: mean lat.: 6231.296ms, rate sampling interval: 17334ms
  Thread calibration: mean lat.: 5450.069ms, rate sampling interval: 15949ms
  Thread calibration: mean lat.: 5856.000ms, rate sampling interval: 16277ms
  Thread calibration: mean lat.: 4256.896ms, rate sampling interval: 15130ms
  Thread calibration: mean lat.: 4746.240ms, rate sampling interval: 15499ms
  Thread calibration: mean lat.: 5419.349ms, rate sampling interval: 15745ms
  Thread calibration: mean lat.: 4982.784ms, rate sampling interval: 15351ms
  Thread calibration: mean lat.: 5280.000ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5682.432ms, rate sampling interval: 16007ms
  Thread calibration: mean lat.: 5360.640ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 5106.944ms, rate sampling interval: 15867ms
  Thread calibration: mean lat.: 5573.222ms, rate sampling interval: 15900ms
  Thread calibration: mean lat.: 6109.440ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 4537.344ms, rate sampling interval: 15376ms
  Thread calibration: mean lat.: 4590.592ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 5294.080ms, rate sampling interval: 16179ms
  Thread calibration: mean lat.: 5362.944ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5214.464ms, rate sampling interval: 15605ms
  Thread calibration: mean lat.: 6121.728ms, rate sampling interval: 16842ms
  Thread calibration: mean lat.: 4544.512ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 5500.160ms, rate sampling interval: 15892ms
  Thread calibration: mean lat.: 5379.754ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 5413.205ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 5390.080ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 5392.725ms, rate sampling interval: 15867ms
  Thread calibration: mean lat.: 5340.416ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 5416.618ms, rate sampling interval: 15974ms
  Thread calibration: mean lat.: 5881.600ms, rate sampling interval: 16392ms
  Thread calibration: mean lat.: 5486.848ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5413.205ms, rate sampling interval: 15867ms
  Thread calibration: mean lat.: 5001.728ms, rate sampling interval: 15589ms
  Thread calibration: mean lat.: 5104.896ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 5478.058ms, rate sampling interval: 16211ms
  Thread calibration: mean lat.: 5454.848ms, rate sampling interval: 15974ms
  Thread calibration: mean lat.: 5208.832ms, rate sampling interval: 15261ms
  Thread calibration: mean lat.: 4751.360ms, rate sampling interval: 15400ms
  Thread calibration: mean lat.: 5456.213ms, rate sampling interval: 15826ms
  Thread calibration: mean lat.: 5743.360ms, rate sampling interval: 16064ms
  Thread calibration: mean lat.: 5796.096ms, rate sampling interval: 15998ms
  Thread calibration: mean lat.: 5392.725ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 5312.768ms, rate sampling interval: 15826ms
  Thread calibration: mean lat.: 5531.392ms, rate sampling interval: 15867ms
  Thread calibration: mean lat.: 4633.088ms, rate sampling interval: 15114ms
  Thread calibration: mean lat.: 5171.456ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 6068.480ms, rate sampling interval: 16859ms
  Thread calibration: mean lat.: 5305.344ms, rate sampling interval: 15499ms
  Thread calibration: mean lat.: 5866.240ms, rate sampling interval: 16236ms
  Thread calibration: mean lat.: 5443.925ms, rate sampling interval: 15859ms
  Thread calibration: mean lat.: 5635.328ms, rate sampling interval: 15966ms
  Thread calibration: mean lat.: 5862.656ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 4625.920ms, rate sampling interval: 15269ms
  Thread calibration: mean lat.: 5487.616ms, rate sampling interval: 15998ms
  Thread calibration: mean lat.: 5428.224ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 5007.667ms, rate sampling interval: 16310ms
  Thread calibration: mean lat.: 5420.032ms, rate sampling interval: 16007ms
  Thread calibration: mean lat.: 5186.816ms, rate sampling interval: 15556ms
  Thread calibration: mean lat.: 5336.832ms, rate sampling interval: 15736ms
  Thread calibration: mean lat.: 6199.552ms, rate sampling interval: 17350ms
  Thread calibration: mean lat.: 5629.184ms, rate sampling interval: 15998ms
  Thread calibration: mean lat.: 5396.736ms, rate sampling interval: 15736ms
  Thread calibration: mean lat.: 5294.080ms, rate sampling interval: 15949ms
  Thread calibration: mean lat.: 4873.216ms, rate sampling interval: 15261ms
  Thread calibration: mean lat.: 5905.152ms, rate sampling interval: 16531ms
  Thread calibration: mean lat.: 6298.368ms, rate sampling interval: 18431ms
  Thread calibration: mean lat.: 5326.592ms, rate sampling interval: 15654ms
  Thread calibration: mean lat.: 5999.360ms, rate sampling interval: 16506ms
  Thread calibration: mean lat.: 5385.472ms, rate sampling interval: 15400ms
  Thread calibration: mean lat.: 5387.264ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 6339.328ms, rate sampling interval: 18497ms
  Thread calibration: mean lat.: 5374.976ms, rate sampling interval: 15597ms
  Thread calibration: mean lat.: 5424.128ms, rate sampling interval: 15851ms
  Thread calibration: mean lat.: 5562.112ms, rate sampling interval: 15998ms
  Thread calibration: mean lat.: 6085.376ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 5357.824ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 5422.848ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 5935.872ms, rate sampling interval: 16433ms
  Thread calibration: mean lat.: 5164.800ms, rate sampling interval: 15474ms
  Thread calibration: mean lat.: 6102.272ms, rate sampling interval: 16957ms
  Thread calibration: mean lat.: 5425.493ms, rate sampling interval: 15646ms
  Thread calibration: mean lat.: 4540.416ms, rate sampling interval: 15441ms
  Thread calibration: mean lat.: 6010.112ms, rate sampling interval: 16596ms
  Thread calibration: mean lat.: 5056.768ms, rate sampling interval: 15237ms
  Thread calibration: mean lat.: 5435.136ms, rate sampling interval: 15163ms
  Thread calibration: mean lat.: 5383.850ms, rate sampling interval: 15589ms
  Thread calibration: mean lat.: 5445.376ms, rate sampling interval: 15605ms
  Thread calibration: mean lat.: 5817.088ms, rate sampling interval: 16195ms
  Thread calibration: mean lat.: 4708.352ms, rate sampling interval: 15400ms
  Thread calibration: mean lat.: 5427.456ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 5398.118ms, rate sampling interval: 16400ms
  Thread calibration: mean lat.: 4813.312ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 5249.792ms, rate sampling interval: 15884ms
  Thread calibration: mean lat.: 5864.038ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 5086.464ms, rate sampling interval: 15441ms
  Thread calibration: mean lat.: 5289.216ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 5360.640ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 5041.408ms, rate sampling interval: 15212ms
  Thread calibration: mean lat.: 5357.909ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 5752.576ms, rate sampling interval: 15900ms
  Thread calibration: mean lat.: 4998.912ms, rate sampling interval: 15343ms
  Thread calibration: mean lat.: 5261.056ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 5960.448ms, rate sampling interval: 16646ms
  Thread calibration: mean lat.: 5144.320ms, rate sampling interval: 15245ms
  Thread calibration: mean lat.: 5601.536ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5524.224ms, rate sampling interval: 15867ms
  Thread calibration: mean lat.: 5771.008ms, rate sampling interval: 16039ms
  Thread calibration: mean lat.: 4579.328ms, rate sampling interval: 15286ms
  Thread calibration: mean lat.: 5138.688ms, rate sampling interval: 15532ms
  Thread calibration: mean lat.: 5415.936ms, rate sampling interval: 15884ms
  Thread calibration: mean lat.: 5396.821ms, rate sampling interval: 15654ms
  Thread calibration: mean lat.: 6066.432ms, rate sampling interval: 16875ms
  Thread calibration: mean lat.: 5030.195ms, rate sampling interval: 16203ms
  Thread calibration: mean lat.: 5732.096ms, rate sampling interval: 16080ms
  Thread calibration: mean lat.: 5334.784ms, rate sampling interval: 15286ms
  Thread calibration: mean lat.: 6322.432ms, rate sampling interval: 18415ms
  Thread calibration: mean lat.: 5233.920ms, rate sampling interval: 15654ms
  Thread calibration: mean lat.: 5236.480ms, rate sampling interval: 15605ms
  Thread calibration: mean lat.: 5207.296ms, rate sampling interval: 15384ms
  Thread calibration: mean lat.: 5525.248ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5973.248ms, rate sampling interval: 16539ms
  Thread calibration: mean lat.: 5371.648ms, rate sampling interval: 15745ms
  Thread calibration: mean lat.: 5293.056ms, rate sampling interval: 15376ms
  Thread calibration: mean lat.: 4402.688ms, rate sampling interval: 15007ms
  Thread calibration: mean lat.: 5948.160ms, rate sampling interval: 16449ms
  Thread calibration: mean lat.: 5094.656ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 5476.010ms, rate sampling interval: 15958ms
  Thread calibration: mean lat.: 5522.176ms, rate sampling interval: 15958ms
  Thread calibration: mean lat.: 5599.436ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 5171.968ms, rate sampling interval: 15073ms
  Thread calibration: mean lat.: 5212.569ms, rate sampling interval: 16531ms
  Thread calibration: mean lat.: 5681.408ms, rate sampling interval: 16023ms
  Thread calibration: mean lat.: 5463.722ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5517.056ms, rate sampling interval: 15851ms
  Thread calibration: mean lat.: 5265.664ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 5372.672ms, rate sampling interval: 15523ms
  Thread calibration: mean lat.: 5953.792ms, rate sampling interval: 16515ms
  Thread calibration: mean lat.: 4690.944ms, rate sampling interval: 15499ms
  Thread calibration: mean lat.: 5726.976ms, rate sampling interval: 16048ms
  Thread calibration: mean lat.: 5947.136ms, rate sampling interval: 16457ms
  Thread calibration: mean lat.: 5465.088ms, rate sampling interval: 15908ms
  Thread calibration: mean lat.: 5769.984ms, rate sampling interval: 16171ms
  Thread calibration: mean lat.: 6193.408ms, rate sampling interval: 17842ms
  Thread calibration: mean lat.: 5152.000ms, rate sampling interval: 15261ms
  Thread calibration: mean lat.: 5460.309ms, rate sampling interval: 16031ms
  Thread calibration: mean lat.: 5350.400ms, rate sampling interval: 15515ms
  Thread calibration: mean lat.: 5435.648ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 5964.544ms, rate sampling interval: 16498ms
  Thread calibration: mean lat.: 5700.352ms, rate sampling interval: 16072ms
  Thread calibration: mean lat.: 5399.552ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 5183.232ms, rate sampling interval: 15433ms
  Thread calibration: mean lat.: 5938.432ms, rate sampling interval: 16580ms
  Thread calibration: mean lat.: 5311.692ms, rate sampling interval: 16269ms
  Thread calibration: mean lat.: 5945.600ms, rate sampling interval: 16596ms
  Thread calibration: mean lat.: 6109.440ms, rate sampling interval: 17186ms
  Thread calibration: mean lat.: 5191.424ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 5809.920ms, rate sampling interval: 16195ms
  Thread calibration: mean lat.: 5338.880ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 4690.944ms, rate sampling interval: 15425ms
  Thread calibration: mean lat.: 5282.048ms, rate sampling interval: 15245ms
  Thread calibration: mean lat.: 5391.360ms, rate sampling interval: 15990ms
  Thread calibration: mean lat.: 5778.688ms, rate sampling interval: 16023ms
  Thread calibration: mean lat.: 5704.960ms, rate sampling interval: 15917ms
  Thread calibration: mean lat.: 5253.461ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 6158.080ms, rate sampling interval: 17367ms
  Thread calibration: mean lat.: 5349.034ms, rate sampling interval: 15646ms
  Thread calibration: mean lat.: 5336.064ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 4697.088ms, rate sampling interval: 15073ms
  Thread calibration: mean lat.: 5246.208ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 6321.920ms, rate sampling interval: 18497ms
  Thread calibration: mean lat.: 4978.944ms, rate sampling interval: 15532ms
  Thread calibration: mean lat.: 4839.936ms, rate sampling interval: 15384ms
  Thread calibration: mean lat.: 5592.832ms, rate sampling interval: 15958ms
  Thread calibration: mean lat.: 5186.816ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 5253.888ms, rate sampling interval: 15269ms
  Thread calibration: mean lat.: 5134.592ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 5356.800ms, rate sampling interval: 15556ms
  Thread calibration: mean lat.: 6146.816ms, rate sampling interval: 17596ms
  Thread calibration: mean lat.: 5112.064ms, rate sampling interval: 15548ms
  Thread calibration: mean lat.: 5297.834ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 5345.621ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 4844.544ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 5900.544ms, rate sampling interval: 16261ms
  Thread calibration: mean lat.: 6034.688ms, rate sampling interval: 16752ms
  Thread calibration: mean lat.: 5176.064ms, rate sampling interval: 15056ms
  Thread calibration: mean lat.: 5269.162ms, rate sampling interval: 15499ms
  Thread calibration: mean lat.: 5341.440ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 5392.042ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 5556.480ms, rate sampling interval: 15859ms
  Thread calibration: mean lat.: 5413.888ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 5911.296ms, rate sampling interval: 16310ms
  Thread calibration: mean lat.: 5310.122ms, rate sampling interval: 15556ms
  Thread calibration: mean lat.: 5166.336ms, rate sampling interval: 14893ms
  Thread calibration: mean lat.: 5324.458ms, rate sampling interval: 15548ms
  Thread calibration: mean lat.: 4987.136ms, rate sampling interval: 15048ms
  Thread calibration: mean lat.: 5849.856ms, rate sampling interval: 16293ms
  Thread calibration: mean lat.: 5825.945ms, rate sampling interval: 15736ms
  Thread calibration: mean lat.: 5210.880ms, rate sampling interval: 15392ms
  Thread calibration: mean lat.: 5670.656ms, rate sampling interval: 15949ms
  Thread calibration: mean lat.: 5385.216ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 5401.600ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 5163.264ms, rate sampling interval: 15482ms
  Thread calibration: mean lat.: 5530.368ms, rate sampling interval: 15826ms
  Thread calibration: mean lat.: 5821.184ms, rate sampling interval: 16228ms
  Thread calibration: mean lat.: 5264.384ms, rate sampling interval: 15310ms
  Thread calibration: mean lat.: 5855.488ms, rate sampling interval: 16220ms
  Thread calibration: mean lat.: 5753.088ms, rate sampling interval: 16089ms
  Thread calibration: mean lat.: 5260.970ms, rate sampling interval: 15572ms
  Thread calibration: mean lat.: 5785.856ms, rate sampling interval: 16097ms
  Thread calibration: mean lat.: 5284.608ms, rate sampling interval: 15491ms
  Thread calibration: mean lat.: 4882.432ms, rate sampling interval: 15810ms
  Thread calibration: mean lat.: 5394.090ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 5323.093ms, rate sampling interval: 15761ms
  Thread calibration: mean lat.: 5651.200ms, rate sampling interval: 15859ms
  Thread calibration: mean lat.: 5867.264ms, rate sampling interval: 16400ms
  Thread calibration: mean lat.: 5085.593ms, rate sampling interval: 15826ms
  Thread calibration: mean lat.: 5542.144ms, rate sampling interval: 15826ms
  Thread calibration: mean lat.: 5931.264ms, rate sampling interval: 16654ms
  Thread calibration: mean lat.: 4823.552ms, rate sampling interval: 15458ms
  Thread calibration: mean lat.: 5305.088ms, rate sampling interval: 15425ms
  Thread calibration: mean lat.: 5648.128ms, rate sampling interval: 16031ms
  Thread calibration: mean lat.: 5938.432ms, rate sampling interval: 16277ms
  Thread calibration: mean lat.: 5250.304ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 5232.981ms, rate sampling interval: 15368ms
  Thread calibration: mean lat.: 5127.424ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 5800.192ms, rate sampling interval: 16171ms
  Thread calibration: mean lat.: 5551.360ms, rate sampling interval: 15777ms
  Thread calibration: mean lat.: 5920.000ms, rate sampling interval: 16433ms
  Thread calibration: mean lat.: 5309.440ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 6010.624ms, rate sampling interval: 16859ms
  Thread calibration: mean lat.: 5325.141ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 6105.344ms, rate sampling interval: 17432ms
  Thread calibration: mean lat.: 5338.794ms, rate sampling interval: 15532ms
  Thread calibration: mean lat.: 5846.272ms, rate sampling interval: 16211ms
  Thread calibration: mean lat.: 5199.616ms, rate sampling interval: 15597ms
  Thread calibration: mean lat.: 5395.251ms, rate sampling interval: 17530ms
  Thread calibration: mean lat.: 4983.040ms, rate sampling interval: 14917ms
  Thread calibration: mean lat.: 6068.480ms, rate sampling interval: 17186ms
  Thread calibration: mean lat.: 5777.152ms, rate sampling interval: 16097ms
  Thread calibration: mean lat.: 5318.997ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 5219.584ms, rate sampling interval: 15556ms
  Thread calibration: mean lat.: 6012.672ms, rate sampling interval: 16809ms
  Thread calibration: mean lat.: 4594.688ms, rate sampling interval: 14966ms
  Thread calibration: mean lat.: 4797.952ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 5313.536ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 4598.784ms, rate sampling interval: 15548ms
  Thread calibration: mean lat.: 5811.968ms, rate sampling interval: 16220ms
  Thread calibration: mean lat.: 5406.720ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5088.000ms, rate sampling interval: 15368ms
  Thread calibration: mean lat.: 5314.218ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 5914.880ms, rate sampling interval: 16375ms
  Thread calibration: mean lat.: 4864.000ms, rate sampling interval: 15114ms
  Thread calibration: mean lat.: 5743.872ms, rate sampling interval: 16171ms
  Thread calibration: mean lat.: 5854.464ms, rate sampling interval: 16236ms
  Thread calibration: mean lat.: 5669.120ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 5455.104ms, rate sampling interval: 15351ms
  Thread calibration: mean lat.: 5990.144ms, rate sampling interval: 16596ms
  Thread calibration: mean lat.: 5809.920ms, rate sampling interval: 16121ms
  Thread calibration: mean lat.: 4943.872ms, rate sampling interval: 15532ms
  Thread calibration: mean lat.: 5238.442ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 6012.160ms, rate sampling interval: 16752ms
  Thread calibration: mean lat.: 5089.024ms, rate sampling interval: 15441ms
  Thread calibration: mean lat.: 5888.256ms, rate sampling interval: 16441ms
  Thread calibration: mean lat.: 5330.176ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 5337.429ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 5273.258ms, rate sampling interval: 15400ms
  Thread calibration: mean lat.: 5286.656ms, rate sampling interval: 15499ms
  Thread calibration: mean lat.: 5794.048ms, rate sampling interval: 16015ms
  Thread calibration: mean lat.: 5426.858ms, rate sampling interval: 15917ms
  Thread calibration: mean lat.: 5306.709ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 5740.288ms, rate sampling interval: 16105ms
  Thread calibration: mean lat.: 5217.280ms, rate sampling interval: 15589ms
  Thread calibration: mean lat.: 5400.320ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 5137.664ms, rate sampling interval: 15187ms
  Thread calibration: mean lat.: 5288.704ms, rate sampling interval: 15433ms
  Thread calibration: mean lat.: 5355.178ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 5022.976ms, rate sampling interval: 15515ms
  Thread calibration: mean lat.: 5171.456ms, rate sampling interval: 15556ms
  Thread calibration: mean lat.: 5914.880ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 6145.792ms, rate sampling interval: 17760ms
  Thread calibration: mean lat.: 5229.568ms, rate sampling interval: 15286ms
  Thread calibration: mean lat.: 5964.032ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 5353.130ms, rate sampling interval: 15867ms
  Thread calibration: mean lat.: 5242.624ms, rate sampling interval: 15581ms
  Thread calibration: mean lat.: 5775.104ms, rate sampling interval: 16220ms
  Thread calibration: mean lat.: 5282.133ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 4849.152ms, rate sampling interval: 15261ms
  Thread calibration: mean lat.: 5926.656ms, rate sampling interval: 16613ms
  Thread calibration: mean lat.: 5124.352ms, rate sampling interval: 15269ms
  Thread calibration: mean lat.: 5560.064ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 5295.872ms, rate sampling interval: 15491ms
  Thread calibration: mean lat.: 5902.592ms, rate sampling interval: 16498ms
  Thread calibration: mean lat.: 5809.920ms, rate sampling interval: 16162ms
  Thread calibration: mean lat.: 5776.128ms, rate sampling interval: 16080ms
  Thread calibration: mean lat.: 5268.736ms, rate sampling interval: 15597ms
  Thread calibration: mean lat.: 5742.336ms, rate sampling interval: 15974ms
  Thread calibration: mean lat.: 5247.317ms, rate sampling interval: 15425ms
  Thread calibration: mean lat.: 5604.096ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 5161.728ms, rate sampling interval: 15327ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.58s     3.69s   22.63s    58.32%
    Req/Sec     0.00      0.00     0.00    100.00%
  5743 requests in 26.01s, 549.06MB read
Requests/sec:    220.77
Transfer/sec:     21.11MB